Repository: sibskull/synaptiks
Catalog: po/*.po
Languages: da, ru

# @title:window hardware settings and information
source: Hardware
ru: Оборудование

source: Hardware information
ru: Сведения об оборудовании

source: Hardware settings
da: Hardware-indstillinger
ru: Свойства оборудования

# @info
source: Please enable this setting, if your touchpad is circular.
da: Aktivér denne indstilling hvis din touchpad er cirkulær.
ru: Включите этот параметр, если ваша сенсорная панель поддерживает циклическую прокрутку.

# @option:check
source: The touchpad is circular
da: Touchpaden er cirkulær
ru: Поддержка циклической прокрутки

# @title:window
source: Touchpad management
da: Håndtering af touchpad
ru: Управление сенсорной панелью

# @option:check
source: Automatically start at logon
da: Start automatisk ved login
ru: Автоматически запускать в начале сеанса

# @info:whatsthis
source: Automatically switch off touchpad, if a mouse is plugged in. If the mouse is unplugged, the touchpad is switched on again.
da: Slå automatisk touchpad fra hvis en mus tilsluttes. Hvis musen frakobles, slås touchpad til igen.
ru: Автоматически отключать сенсорную панель когда подключена мышь. При отключении мыши сенсорная панель будет включена вновь.

# @option:check
source: Automatically switch off touchpad, if a mouse is plugged
da: Slå automatisk touchpad fra hvis en mus tilsluttes
ru: Автоматически отключать сенсорную панель когда подключена мышь

# @label
source: Ignore the following mouse devices
da: Ignorér følgende museenheder
ru: Игнорировать указанные устройства мыши:

# @info:whatsthis
source: All checked mouse devices are ignored. If such a mouse is plugged, the touchpad will remain on.
da: Alle markerede museenheder ignoreres. Hvis sådan en mus tilsluttes, vil touchpad forblive tændt.
ru: Все выбранные устройства мыши игнорируются. При подключении такой мыши сенсорная панель будет оставаться включенной.

# @option:check
source: Automatically switch off touchpad on keyboard activity
da: Slå automatisk touchpad fra ved tastaturaktivitet
ru: Автоматически отключать сенсорную панель при вводе с клавиатуры

# @label:listbox
source: Ignore these keys
da: Ignorér disse taster
ru: Игнорировать указанные клавиши:

# @info:tooltip
source: <para>These keys will be ignored when monitoring the keyboard:</para> <para> <list> <item><interface>No keys</interface>: No keys are ignored. Every key causes the touchpad to be switched off.</item> <item><interface>Modifier keys</interface>: Modifier keys (e.g. Shift, Ctrl) are ignored. Every other key causes the touchpad to be switched off, even when pressed in combination with a modifier key (e.g. Ctrl+S).</item> <item><interface>Modifier combinations</interface>: Modifier keys and normal keys in combination with modifier keys are ignored. Every other key causes the touchpad to be switched off. Note, that even Shift-combinations for uppercase letters are ignored with this setting.</item> </list>
da: <para>Disse taster vil blive ignoreret ved overvågning af tastaturet:</para> <para> <list> <item><interface>Ingen taster</interface>: Ingen taster ignoreres. Alle taster betyder at touchpad slås fra.</item> <item><interface>Ændringstaster</interface>: Ændringstaster (f.eks. Skift, Ctrl) ignoreres. Alle andre taster betyder at touchpad slås fra, selv når de trykkes i kombination med en ændringstast (f.eks. Ctrl+s).</item> <item><interface>Ændringskombinationer</interface>: Ændringstaster og almindelige taster i kombination med med ændringstaster ignoreres. Alle andre taster betyder at touchpad slås fra. Bemærk at selv Skift-kombinationer for store bogstaver ignoreres med denne indstilling.</item> </list>
ru: <para>Указанные клавиши будут игнорироваться при проверки ввода с клавиатуры:</para> <para> <list> <item><interface>Не игнорировать</interface>: не игнорировать ни одну клавишу. Нажатие любой клавиши приведёт к отключению сенсорной панели.</item> <item><interface>Модификаторы</interface>: игнорировать клавиши-модификаторы (например, Shift или Ctrl).Нажатие любой другой клавиши (даже с модификатором, например, Ctrl+S) приведёт к отключению сенсорной панели.</item> <item><interface>Комбинации клавиш</interface>: игнорировать комбинации обычных клавиш с модификаторами. Нажатие любой другой клавиши приведёт к отключению сенсорной панели. Комбинации клавиш с Shift (для ввода символов в верхнем регистре) тоже будут игнорироваться.</item> </list>

# @info:whatsthis
source: <para>These keys will be ignored when monitoring the keyboard:</para> <para> <list> <item><interface>No keys</interface>: No keys are ignored. Every key causes the touchpad to be switched off.</item> <item><interface>Modifier keys</interface>: Modifier keys (e.g. Shift, Ctrl) are ignored. Every other key causes the touchpad to be switched off, even when pressed in combination with a modifier key (e.g. Ctrl+S).</item> <item><interface>Modifier combinations</interface>: Modifier keys and normal keys in combination with modifier keys are ignored. Every other key causes the touchpad to be switched off. Note, that even Shift-combinations for uppercase letters are ignored with this setting.</item> </list>
da: <para>Disse taster vil blive ignoreret ved overvågning af tastaturet:</para> <para> <list> <item><interface>Ingen taster</interface>: Ingen taster ignoreres. Alle taster betyder at touchpad slås fra.</item> <item><interface>Ændringstaster</interface>: Ændringstaster (f.eks. Skift, Ctrl) ignoreres. Alle andre taster betyder at touchpad slås fra, selv når de trykkes i kombination med en ændringstast (f.eks. Ctrl+s).</item> <item><interface>Ændringskombinationer</interface>: Ændringstaster og almindelige taster i kombination med med ændringstaster ignoreres. Alle andre taster betyder at touchpad slås fra. Bemærk at selv Skift-kombinationer for store bogstaver ignoreres med denne indstilling.</item> </list>
ru: <para>Указанные клавиши будут игнорироваться при проверки ввода с клавиатуры:</para> <para> <list> <item><interface>Не игнорировать</interface>: не игнорировать ни одну клавишу. Нажатие любой клавиши приведёт к отключению сенсорной панели.</item> <item><interface>Модификаторы</interface>: игнорировать клавиши-модификаторы (например, Shift или Ctrl).Нажатие любой другой клавиши (даже с модификатором, например, Ctrl+S) приведёт к отключению сенсорной панели.</item> <item><interface>Комбинации клавиш</interface>: игнорировать комбинации обычных клавиш с модификаторами. Нажатие любой другой клавиши приведёт к отключению сенсорной панели. Комбинации клавиш с Shift (для ввода символов в верхнем регистре) тоже будут игнорироваться.</item> </list>

# @item:inlistbox automatic touchpad control
source: No keys
da: Ingen taster
ru: Не игнорировать

# @item:inlistbox automatic touchpad control
source: Modifier keys
da: Ændringstaster
ru: Модификаторы

# @item:inlistbox automatic touchpad control
source: Modifier combinations
da: Ændringskombinationer
ru: Комбинации клавиш

# @label:spinbox
source: Time to wait before switching the touchpad on again
da: Ventetid før touchpad aktiveres igen
ru: Время ожидания включения сенсорной панели

# @label:spinbox
source: s
ru: с

# @title:window scrolling settings
source: Scrolling
da: Rulning
ru: Прокрутка

# @title:group
source: Horizontal scrolling
da: Vandret rulning
ru: Горизонтальная прокрутка

# @option:check
source: Horizontal scrolling with two fingers
da: Vandret rulning med to fingre
ru: Горизонтальная прокрутка двумя пальцами

# @option:check
source: Horizontal scrolling at bottom edge
da: Vandret rulning ved nederste kant
ru: Горизонтальная прокрутка у нижнего края

# @label:slider
source: Move distance to scroll a single line
da: Bevægeafstand for at rulle én linje
ru: Расстояние для прокрутки одной строки

# @title:group
source: Vertical scrolling
da: Lodret rulning
ru: Вертикальная прокрутка

# @option:check
source: Vertical scrolling with two fingers
da: Lodret rulning med to fingre
ru: Вертикальная прокрутка двумя пальцами

# @option:check
source: Vertical scrolling at right edge
da: Lodret rulning ved højre kant
ru: Вертикальная прокрутка у правого края

# @option:check
source: Continue edge scrolling automatically
da: Fortsæt automatisk kantrulning
ru: Автоматическое продолжение прокрутки

# @label:spinbox
source: Scrolling speed threshold to continue scrolling
da: Tærskel på rullehastighed for at fortsætte rulning
ru: Порог скорости прокрутки для ее продолжения

# @item num input special value zero
source: Disabled
da: Deaktiveret
ru: Отключено

# @option:radio
source: Continue edge scrolling, while the finger stays in an edge corner
da: Fortsæt kantrulning, mens fingeren forbliver i et kanthjørne
ru: Продолжать прокрутку когда палец остается в углу

# @option:check
source: Horizontal circular scrolling
da: Vandret cirkulær rulning
ru: Циклическая прокрутка

# @label:listbox
source: Area, which triggers circular scrolling
da: Område som udløser cirkulær rulning
ru: Область циклической прокрутки

# @item:inlistbox circular scrolling trigger area
source: Any edge
da: Alle kanter
ru: Любой край

# @item:inlistbox circular scrolling trigger area
source: Top edge
da: Øverste kant
ru: Верхний край

# @item:inlistbox circular scrolling trigger area
source: Top right corner
da: Øverste højre hjørne
ru: Верхний правый угол

# @item:inlistbox circular scrolling trigger area
source: Right edge
da: Højre kant
ru: Правый край

# @item:inlistbox circular scrolling trigger area
source: Bottom right corner
da: Nederste højre hjørne
ru: Нижний правый угол

# @item:inlistbox circular scrolling trigger area
source: Bottom edge
da: Nederste kant
ru: Нижний край

# @item:inlistbox circular scrolling trigger area
source: Bottom left corner
da: Nederste venstre hjørne
ru: Нижний левый угол

# @item:inlistbox circular scrolling trigger area
source: Left edge
da: Venstre kant
ru: Левый край

# @item:inlistbox circular scrolling trigger area
source: Top left corner
da: Øverste venstre hjørne
ru: Верхний левый угол

# @info:tooltip
source: Move the finger by this angle on the touchpad to scroll a single line. The higher the angle, the slower circular scrolling becomes
da: Bevæg fingeren med denne vinkel på touchpaden for at rulle én linje. Des større vinkel, des langsommere bliver cirkulær rulning
ru: Двигайте палец по сенсорной панели для прокрутки одной строки. Чем больше радиус, тем медленнее циклическая прокрутка

# @info:whatsthis
source: Move the finger by this angle on the touchpad to scroll a single line. The higher the angle, the slower circular scrolling becomes
da: Bevæg fingeren med denne vinkel på touchpaden for at rulle én linje. Des større vinkel, des langsommere bliver cirkulær rulning
ru: Двигайте палец по сенсорной панели для прокрутки одной строки. Чем больше радиус, тем медленнее циклическая прокрутка

# @label:spinbox
source: Angle by which to move the finger to scroll a single line
da: Vinkel hvormed fingeren skal bevæges for at rulle én linje
ru: Угол движения пальца для прокрутки одной строки

# @title:window cursor motion settings
source: Cursor motion
da: Markørbevægelse
ru: Курсор

# @title:group
source: Cursor motion speed
da: Bevægelseshastighed for markør
ru: Скорость движения курсора

# @label:slider
source: Minimum speed
da: Mindste hastighed
ru: Минимальная скорость

# @label:slider
source: Maximum speed
da: Højeste hastighed
ru: Максимальная скорость

# @info:tooltip
source: The acceleration factor defines the acceleration between minimum and maximum speed
da: Accelerationsfaktoren definerer accelerationen mellem mindste og højeste hastighed
ru: Ускорение определяет скорость роста с минимальной до максимальной скорости

# @info:whatsthis
source: The acceleration factor defines the acceleration between minimum and maximum speed. If minimum and maximum speed are equal, acceleration is not used.
da: Accelerationsfaktoren definerer accelerationen mellem mindste og højeste hastighed. Hvis mindste og højeste hastighed er ens benyttes acceleration ikke.
ru: Ускорение определяет скорость роста с минимальной до максимальной скорости. Если эти скорости одинаковы, ускорение не используется.

# @label:slider
source: Acceleration factor
da: Accelerationsfaktor
ru: Ускорение

# @title:group
source: Continue cursor motion when hitting the touchpad edge
da: Fortsæt markørbevægelse når touchpadens kant rammes
ru: Продолжать движение курсора при достижении края сенсорной панели

# @option:radio
source: For all movements, not only dragging
da: For alle bevægelser, ikke kun trækning
ru: Для любого вида движения, не только перетаскивания

# @title:window tapping settings
source: Tapping
da: Tapning
ru: Нажатие

# @title:group
source: General tapping settings
da: Generelle indstillinger for tapning
ru: Общее

# @option:check
source: Make single taps faster and double taps slower (fast taps)
da: Gør enkelt-tap hurtigere og dobbelt-tap langsommere (hurtige tap)
ru: Распознавать одиночные нажатия быстрее, двойные нажатия медленнее (быстрые нажатия)

# @title:group
source: Mouse clicks triggered by tapping
da: Museklik udløst ved tapning
ru: Соответствие нажатия щелчку мыши

# @label:listbox
source: Top left corner
da: Øverste venstre hjørne
ru: Верхний левый угол

# @label:listbox
source: Top right corner
da: Øverste højre hjørne
ru: Верхний правый угол

# @label:listbox
source: Tapping with one finger
da: Tappe med én finger
ru: Нажатие одним пальцем

# @label:listbox
source: Tapping with two fingers
da: Tappe med to fingre
ru: Нажатие двумя пальцами

# @label:listbox
source: Tapping with three fingers
da: Tappe med tre fingre
ru: Нажатие тремя пальцами

# @label:listbox
source: Bottom left corner
da: Nederste venstre hjørne
ru: Нижний левый угол

# @label:listbox
source: Bottom right corner
da: Nederste højre hjørne
ru: Нижний правый угол

# @option:check
source: Drag items by tapping the touchpad and then immediately touching it again
da: Træk elementer ved at tappe på touchpaden og straks berøre den igen
ru: Перетаскивание двойным нажатием

# @option:check
source: Continue dragging when releasing the finger until the touchpad is touched again
da: Fortsæt med at trække når fingeren løftes indtil touchpaden berøres igen
ru: Продолжать перетаскивание при отпускании одного пальца до тех пор, пока не будет ещё одного нажатия

# @label:spinbox
source: Timeout to automatically stop dragging
da: Tidsudløb til at stoppe trækning automatisk
ru: Длительность автоматического перетаскивания

# @label:spinbox seconds
source: s
ru: с

# @title:window
source: Touchpad information
ru: Оборудование

# @label:spinbox
source: How many fingers are detected by this touchpad?
da: Hvor mange fingre detekteres af denne touchpad?
ru: Поддерживается одновременных нажатий

source: Two-finger emulation
da: To-finger-emulering
ru: Эмуляция двойного нажатия

# @label touchpad information detection of pressure of a touch
source: Pressure detection
da: Detektion af tryk
ru: Определение нажатия

# @label touchpad information detection of finger width
source: Finger width detection
da: Detektion af fingerbredde
ru: Определение толщины следа пальца

# @label touchpad information two-finger emulation supported
source: Two-finger emulation
da: To-finger-emulering
ru: Эмуляция двойного нажатия

# @title:group touchpad information mouse button support
source: Buttons
da: Knapper
ru: Наличие кнопок

# @label touchpad information mouse button
source: Left button
da: venstre knap
ru: Левая кнопка

# @label touchpad information mouse button
source: Middle button
da: Midterknap
ru: Средняя кнопка

# @label touchpad information mouse button
source: Right button
da: Højre knap
ru: Правая кнопка

# About data copyright
source: Copyright © 2009, 2010, 2011 Sebastian Wiesner
da: Ophavsret © 2009, 2010, 2011 Sebastian Wiesner
ru: © Sebastian Wiesner, 2009-2011

# custom author text plain text
source: Please report bugs to the issue tracker at %1
da: Rapportér venligst programfejl i problemregistreringen på %1
ru: Сообщайте об ошибках на %1

# @info custom author text rich text
source: Please report bugs to the <link url="%1">issue tracker</link>.
da: Rapportér venligst programfejl i <link url="%1">problemregistreringen</link>.
ru: Сообщайте об ошибках на <link url="%1">сайте</link>.

# NAME OF TRANSLATORS
source: Your names
da: Martin Schlander
ru: Валентин Павлюченко,Андрей Черепанов

# EMAIL OF TRANSLATORS
source: Your emails
da: mschlander@opensuse.org
ru: thevalik@gmail.com,skull@kde.ru

# author task
source: Maintainer
da: Vedligeholder
ru: Сопровождение

# credit name
source: Valentyn Pavliuchenko
ru: Валентин Павлюченко

# credit task
source: Debian packaging, russian translation, bug reporting and testing
da: Debian-pakker, russisk oversættelse, fejlrapportering og test
ru: Сборка для Debian, российская локализация, тестирование и отчеты об ошибках

# @info NoTouchpadError error message
source: <title>No touchpad found</title><para>No touchpad was found in this system. If the system has a touchpad, please make sure that the <application>synaptics</application> driver is properly installed and configured.</para><para>If your touchpad is not found, though the driver is installed and configured correctly, please compile detailed information about your touchpad hardware and report this issue to the <link url="%1">issue tracker</link>.</para>
da: <title>Ingen touchpad fundet</title><para>Der blev ikke fundet en touchpad på dette system. Hvis systemet har en touchpad, så kontrollér om <application>synaptics</application>-driveren korrekt installeret og konfigureret.</para><para>Hvis din touchpad ikke findes, selvom driveren er installeret og konfigureret korrekt, så indsaml venligst detaljeret information om din touchpad-hardware og rapportér problemet i <link url="%1">problemregistreringen</link>.</para>
ru: <title>Сенсорная панель не найдена</title><para>В системе не обнаружена ни одна сенсорная панель. Если это не так, проверьте установку и правильную настройку драйвера <application>synaptics</application>.</para>

# @info XInputVersionError error message
source: <title>Version error</title><para>The version of the XInput extension installed on your system is too old. Version %1 was found, but at least version %2 is required.</para><para>If you want to be able to configure your touchpad, you have to upgrade your system to a recent release of the Xorg display server. This may likely involve a complete upgrade of your system. Please excuse this inconvenience, but there is no way to make touchpad configuration work on systems as old as yours.</para>
da: <title>Versionsfejl</title><para>Den version af XInput-udvidelsen der er installeret på dit system er for gammel. Version %1 blev fundet, men der kræves mindst version %2.</para><para>Hvis du vil kunne konfigurere din touchpad, skal du opgradere dit system til en nyere udgivelse af Xorg skærmserveren. Dette indebærer sandsynligvis en opgradering af hele dit system. Vi beklager ulejligheden, men det er ikke muligt at få touchpad-konfiguration til at virke på et system der er så gammelt som dit.</para>
ru: <title>Ошибка совместимости</title><para>Версия %1 расширения XInput, установленного в вашей системе, слишком старая. Для настройки сенсорной панели требуется версия %2.</para><para>Если вы хотите настроить сенсорную панель, обновите версию сервера Xorg.</para>

# @info error message for unexpected errors
source: <title>Unexpected error occurred</title><para>An unexpected error occurred: <message>%2</message></para><para>Please report this issue to the <link url="%1">issue tracker</link>.</para>
da: <title>Uventet fejl opstod</title><para>En uventet fejl opstod: <message>%2</message></para><para>Rapportér venligst dette problem i <link url="%1">problemregistreringen</link>.</para>
ru: <title>Произошла неизвестная ошибка/title><para>Произошла неизвестная ошибка: <message>%2</message></para><para>Сообщите об этой ошибке на <link url="%1">сайт</link>.</para>

# @action:inmenu
source: Touchpad on
da: Touchpad til
ru: Сенсорная панель включена

# touchpad switched notification
source: Touchpad switched off
da: Touchpad slået fra
ru: Сенсорная панель отключена

# touchpad switched notification
source: Touchpad switched on
da: Touchpad slået til
ru: Сенсорная панель включена

# tray application description
source: touchpad management application
da: Program til håndtering af touchpad
ru: управление сенсорной панелью

# kcmodule description
source: Touchpad configuration
da: Konfiguration af touchpad
ru: Сенсорная панель

# @info:tooltip synaptiks kcmodule
source: <title>Touchpad configuration</title><para>This module lets you configure your touchpad.</para>
da: <title>Konfiguration af touchpad</title><para>Dette modul lader dig konfigurere din touchpad.</para>
ru: <title>Сенсорная панель</title><para>Этот модуль позволит настроить сенсорную панель.</para>

# @item coasting speed special value
source: Disabled
da: Deaktiveret
ru: Отключено

# @title:window
source: Touchpad configuration
da: Konfiguration af touchpad
ru: Сенсорная панель

# @item:inlistbox mouse button triggered by tapping
source: Disabled
da: Deaktiveret
ru: Отключено

# @item:inlistbox mouse button triggered by tapping
source: Left mouse button
da: Venstre museknap
ru: Левая кнопка мыши

# @item:inlistbox mouse button triggered by tapping
source: Middle mouse button
da: Midterste museknap
ru: Средняя кнопка мыши

# @item:inlistbox mouse button triggered by tapping
source: Right mouse button
da: Højre museknap
ru: Правая кнопка мыши
